In [12]:
import pandas as pd

data = pd.read_csv('./data/stock_day.csv')
data.head()

         date   close    volume    open    high     low
0  2019-04-15  183.07  14610190  188.06  188.17  182.56
1  2019-04-12  188.91  12561090  187.71  189.79  187.14
2  2019-04-11  184.98   8848863  185.15  186.06  183.75
3  2019-04-10  186.19  10650950  186.69  187.40  184.00
4  2019-04-09  187.19  11571350  186.49  187.89  186.16

In [14]:
#直接索引只能列后行
data["open"][0]

188.06

In [20]:
# 用loc可以先行后列
data.loc[1:3, "date":"close"]

         date   close
1  2019-04-12  188.91
2  2019-04-11  184.98
3  2019-04-10  186.19

In [21]:
# iloc用下标索引
data.iloc[:5,:3]

         date   close    volume
0  2019-04-15  183.07  14610190
1  2019-04-12  188.91  12561090
2  2019-04-11  184.98   8848863
3  2019-04-10  186.19  10650950
4  2019-04-09  187.19  11571350

In [23]:
data.loc[data.index[0:5],['open','close']]

     open   close
0  188.06  183.07
1  187.71  188.91
2  185.15  184.98
3  186.69  186.19
4  186.49  187.19

In [24]:
data.loc[1:3, ["date","close"]]

         date   close
1  2019-04-12  188.91
2  2019-04-11  184.98
3  2019-04-10  186.19

In [31]:
data.head()

         date   close    volume    open    high     low
0  2019-04-15  183.07  14610190  188.06  188.17  182.56
1  2019-04-12  188.91  12561090  187.71  189.79  187.14
2  2019-04-11  184.98   8848863  185.15  186.06  183.75
3  2019-04-10  186.19  10650950  186.69  187.40  184.00
4  2019-04-09  187.19  11571350  186.49  187.89  186.16

In [29]:
data.columns.get_indexer(['open','close'])

array([3, 1])

In [28]:
data.iloc[1:3,data.columns.get_indexer(['open','close'])]

     open   close
1  187.71  188.91
2  185.15  184.98

# 2 赋值操作

In [33]:
data['close']=1
data.head()

         date  close    volume    open    high     low
0  2019-04-15      1  14610190  188.06  188.17  182.56
1  2019-04-12      1  12561090  187.71  189.79  187.14
2  2019-04-11      1   8848863  185.15  186.06  183.75
3  2019-04-10      1  10650950  186.69  187.40  184.00
4  2019-04-09      1  11571350  186.49  187.89  186.16

In [35]:
data.close = 10
data.head()

         date  close    volume    open    high     low
0  2019-04-15     10  14610190  188.06  188.17  182.56
1  2019-04-12     10  12561090  187.71  189.79  187.14
2  2019-04-11     10   8848863  185.15  186.06  183.75
3  2019-04-10     10  10650950  186.69  187.40  184.00
4  2019-04-09     10  11571350  186.49  187.89  186.16

# 3 排序

In [37]:
# 排序 by指定哪个列， ascending指定升序降序
data.sort_values(by="open",ascending=True).head()

           date  close    volume   open    high     low
714  2016-06-13     10  11289770  75.25  76.455  74.850
703  2016-06-28     10  11238520  75.50  76.600  75.500
741  2016-05-04     10  14289990  75.64  75.910  75.010
704  2016-06-27     10  15203760  75.80  76.290  73.300
742  2016-05-03     10   8008683  75.96  76.270  75.425

In [39]:
# 
data.sort_values(by=["open","close"]).head()

           date  close    volume   open    high     low
714  2016-06-13     10  11289770  75.25  76.455  74.850
703  2016-06-28     10  11238520  75.50  76.600  75.500
741  2016-05-04     10  14289990  75.64  75.910  75.010
704  2016-06-27     10  15203760  75.80  76.290  73.300
742  2016-05-03     10   8008683  75.96  76.270  75.425

In [42]:
# 索引排序
data.sort_index()

           date  close    volume    open     high     low
0    2019-04-15     10  14610190  188.06  188.170  182.56
1    2019-04-12     10  12561090  187.71  189.790  187.14
2    2019-04-11     10   8848863  185.15  186.060  183.75
3    2019-04-10     10  10650950  186.69  187.400  184.00
4    2019-04-09     10  11571350  186.49  187.890  186.16
..          ...    ...       ...     ...      ...     ...
750  2016-04-21     10   8812676   81.08   81.780   80.20
751  2016-04-20     10  14900920   79.00   81.735   78.99
752  2016-04-19     10  14727460   79.20   80.480   78.47
753  2016-04-18     10   7761672   78.52   79.120   77.71
754  2016-04-15     10  11696030   79.45   79.750   78.46

[755 rows x 6 columns]

In [45]:
# 单独取一列，然后值排序
data['open'].sort_values().head(6)

714    75.25
703    75.50
741    75.64
704    75.80
742    75.96
715    76.43
Name: open, dtype: float64

In [46]:
# 单独取一列，然后索引排序
data['open'].sort_index().head(6)

0    188.06
1    187.71
2    185.15
3    186.69
4    186.49
5    184.19
Name: open, dtype: float64